<a href="https://colab.research.google.com/github/wisrovi/visualizacion-cajamar/blob/main/Concurso_Cajamar_visualizacion_datos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Este cuaderno contiene recetas para cargar y guardar datos procedentes de fuentes externas.

# Obtener los dataset de CAJAMAR

In [2]:
!git clone https://github.com/wisrovi/visualizacion-cajamar

Cloning into 'visualizacion-cajamar'...
remote: Enumerating objects: 15, done.
remote: Counting objects: 100% (15/15), done.
remote: Compressing objects: 100% (13/13), done.
remote: Total 15 (delta 2), reused 5 (delta 1), pack-reused 0
Unpacking objects: 100% (15/15), done.

In [3]:
!ls 'visualizacion-cajamar/'

'Dataset1.- DatosConsumoAlimentarioMAPAporCCAA.txt'
'Dataset2.- Precios Semanales Observatorio de Precios Junta de Andalucia.txt'
 Dataset3a_Datos_MercaMadrid.txt
 Dataset3b_Datos_MercaBarna.txt
'Dataset4.- Comercio Exterior de Espa¤a.txt'
 Dataset5_Coronavirus_cases.txt
 LICENSE
 README.md

In [9]:
FOLDER_DATASET = 'visualizacion-cajamar/'

# Leer los dataset con pandas

In [5]:
import pandas as pd

In [20]:
d1 = pd.read_csv(FOLDER_DATASET + 'Dataset1.- DatosConsumoAlimentarioMAPAporCCAA.txt', sep='|', index_col=0)
d1.head(5)

        Mes            CCAA  ... Unnamed: 10 Unnamed: 11
Año                          ...
2018  Enero  Total Nacional  ...         NaN         NaN
2018  Enero  Total Nacional  ...         NaN         NaN
2018  Enero  Total Nacional  ...         NaN         NaN
2018  Enero  Total Nacional  ...         NaN         NaN
2018  Enero  Total Nacional  ...         NaN         NaN

[5 rows x 11 columns]

In [14]:
d2 = pd.read_csv(FOLDER_DATASET + 'Dataset2.- Precios Semanales Observatorio de Precios Junta de Andalucia.txt', sep='|', index_col=0)
d2.head(5)

                   FIN     GRUPO    SECTOR  ... FORMATO PRECIO    UNIDAD
INICIO                                      ...
01/01/2018  07/01/2018  Agrícola  Frutales  ...     NaN   0,92  Euros/kg
01/01/2018  07/01/2018  Agrícola  Frutales  ...     NaN   0,84  Euros/kg
01/01/2018  07/01/2018  Agrícola  Frutales  ...     NaN   0,78  Euros/kg
01/01/2018  07/01/2018  Agrícola  Frutales  ...     NaN   1,01  Euros/kg
01/01/2018  07/01/2018  Agrícola  Frutales  ...     NaN   3,77  Euros/kg

[5 rows x 12 columns]

In [17]:
d3_A = pd.read_csv(FOLDER_DATASET + 'Dataset3a_Datos_MercaMadrid.txt', sep='|', index_col=0)
d3_A.head(5)

            variedad     origen Unidad  ... price_min  price_max  Volumen
product                                 ...
ACEITUNAS  ACEITUNAS    ALMERIA     kg  ...      3,31       3,61     6700
ACEITUNAS  ACEITUNAS    ALMERIA     kg  ...      3,31       3,61      400
ACEITUNAS  ACEITUNAS    ALMERIA     kg  ...      3,31       3,61      260
ACEITUNAS  ACEITUNAS    BADAJOZ     kg  ...      3,31       3,61    24060
ACEITUNAS  ACEITUNAS  BARCELONA     kg  ...         0          0     1000

[5 rows x 10 columns]

In [18]:
d3_B = pd.read_csv(FOLDER_DATASET + 'Dataset3a_Datos_MercaMadrid.txt', sep='|', index_col=0)
d3_B.head(5)

            variedad     origen Unidad  ... price_min  price_max  Volumen
product                                 ...
ACEITUNAS  ACEITUNAS    ALMERIA     kg  ...      3,31       3,61     6700
ACEITUNAS  ACEITUNAS    ALMERIA     kg  ...      3,31       3,61      400
ACEITUNAS  ACEITUNAS    ALMERIA     kg  ...      3,31       3,61      260
ACEITUNAS  ACEITUNAS    BADAJOZ     kg  ...      3,31       3,61    24060
ACEITUNAS  ACEITUNAS  BARCELONA     kg  ...         0          0     1000

[5 rows x 10 columns]

In [19]:
d4 = pd.read_csv(FOLDER_DATASET + 'Dataset4.- Comercio Exterior de Espa¤a.txt', sep='|', index_col=0)
d4.head(5)

          REPORTER PARTNER  ...         INDICATORS Value
PERIOD                      ...
Jan. 2018  Austria      ES  ...     VALUE_IN_EUROS     :
Jan. 2018  Austria      ES  ...  QUANTITY_IN_100KG     :
Jan. 2018  Austria      ES  ...     VALUE_IN_EUROS     :
Jan. 2018  Austria      ES  ...  QUANTITY_IN_100KG     :
Feb. 2018  Austria      ES  ...     VALUE_IN_EUROS     :

[5 rows x 6 columns]

In [21]:
d5 = pd.read_csv(FOLDER_DATASET + 'Dataset5_Coronavirus_cases.txt', sep='|', index_col=0)
d5.head(5)

            day  ...  Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
dateRep          ...
29/11/2020   29  ...                                          6,8451097
28/11/2020   28  ...                                         6,78464983
27/11/2020   27  ...                                         6,39560365
26/11/2020   26  ...                                         7,34193218
25/11/2020   25  ...                                          7,1999829

[5 rows x 11 columns]

# Limpio los datos